OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87k90.h
extern __at(0x0F7A) __sfr LCDDATA20;

typedef struct
  {
  unsigned S16C3                : 1;
  unsigned S17C3                : 1;
  unsigned S18C3                : 1;
  unsigned S19C3                : 1;
  unsigned S20C3                : 1;
  unsigned S21C3                : 1;
  unsigned S22C3                : 1;
  unsigned S23C3                : 1;
  } __LCDDATA20bits_t;

extern __at(0x0F7A) volatile __LCDDATA20bits_t LCDDATA20bits;

#define _S16C3                  0x01
#define _S17C3                  0x02
#define _S18C3                  0x04
#define _S19C3                  0x08
#define _S20C3                  0x10
#define _S21C3                  0x20
#define _S22C3                  0x40
#define _S23C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA21 Bits

extern __at(0x0F7B) __sfr LCDDATA21;

typedef struct
  {
  unsigned S24C3                : 1;
  unsigned S25C3                : 1;
  unsigned S26C3                : 1;
  unsigned S27C3                : 1;
  unsigned S28C3                : 1;
  unsigned S29C3                : 1;
  unsigned S30C3                : 1;
  unsigned S31C3                : 1;
  } __LCDDATA21bits_t;

extern __at(0x0F7B) volatile __LCDDATA21bits_t LCDDATA21bits;

#define _S24C3                  0x01
#define _S25C3                  0x02
#define _S26C3                  0x04
#define _S27C3                  0x08
#define _S28C3                  0x10
#define _S29C3                  0x20
#define _S30C3                  0x40
#define _S31C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA22 Bits

extern __at(0x0F7C) __sfr LCDDATA22;

typedef struct
  {
  unsigned S32C3                : 1;
  unsigned S33C3                : 1;
  unsigned S34C3                : 1;
  unsigned S35C3                : 1;
  unsigned S36C3                : 1;
  unsigned S37C3                : 1;
  unsigned S38C3                : 1;
  unsigned S39C3                : 1;
  } __LCDDATA22bits_t;

extern __at(0x0F7C) volatile __LCDDATA22bits_t LCDDATA22bits;

#define _S32C3                  0x01
#define _S33C3                  0x02
#define _S34C3                  0x04
#define _S35C3                  0x08
#define _S36C3                  0x10
#define _S37C3                  0x20
#define _S38C3                  0x40
#define _S39C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA23 Bits

extern __at(0x0F7D) __sfr LCDDATA23;

typedef struct
  {
  unsigned S40C3                : 1;
  unsigned S41C3                : 1;
  unsigned S42C3                : 1;
  unsigned S43C3                : 1;
  unsigned S44C3                : 1;
  unsigned S45C3                : 1;
  unsigned S46C3                : 1;
  unsigned S47C3                : 1;
  } __LCDDATA23bits_t;

extern __at(0x0F7D) volatile __LCDDATA23bits_t LCDDATA23bits;

#define _S40C3                  0x01
#define _S41C3                  0x02
#define _S42C3                  0x04
#define _S43C3                  0x08
#define _S44C3                  0x10
#define _S45C3                  0x20
#define _S46C3                  0x40
#define _S47C3                  0x80

//==============================================================================

extern __at(0x0F7E) __sfr EECON2;

//==============================================================================
//        EECON1 Bits

extern __at(0x0F7F) __sfr EECON1;

typedef struct
  {
  unsigned RD                   : 1;
  unsigned WR                   : 1;
  unsigned WREN                 : 1;
  unsigned WRERR                : 1;
  unsigned FREE                 : 1;
  unsigned                      : 1;
  unsigned CFGS                 : 1;
  unsigned EEPGD                : 1;
  } __EECON1bits_t;

extern __at(0x0F7F) volatile __EECON1bits_t EECON1bits;

#define _RD                     0x01
#define _WR                     0x02
#define _WREN                   0x04
#define _WRERR                  0x08
#define _FREE                   0x10
#define _CFGS                   0x40
#define _EEPGD                  0x80

//==============================================================================


//==============================================================================
//        PORTA Bits

extern __at(0x0F80) __sfr PORTA;

typedef union
  {
  struct
    {
    unsigned RA0                : 1;
    unsigned RA1                : 1;
    unsigned RA2                : 1;
    unsigned RA3                : 1;
    unsigned RA4                : 1;
    unsigned RA5                : 1;
    unsigned RA6                : 1;
    unsigned RA7                : 1;
    };

  struct
    {
    unsigned AN0                : 1;
    unsigned AN1                : 1;
    unsigned AN2                : 1;
    unsigned AN3                : 1;
    unsigned SEG14              : 1;
    unsigned AN4                : 1;
    unsigned OSC2               : 1;
    unsigned OSC1               : 1;
    };

  struct
    {
    unsigned ULPWUIN            : 1;
    unsigned SEG18              : 1;
    unsigned VREF_MINUS         : 1;
    unsigned VREF_PLUS          : 1;
    unsigned T0CKI              : 1;
    unsigned SEG15              : 1;
    unsigned CLKO               : 1;
    unsigned CLKI               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1CKI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3G                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LVDIN              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTAbits_t;

extern __at(0x0F80) volatile __PORTAbits_t PORTAbits;

