OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87k90.h
//----------------------------- CONFIG2H Options -------------------------------

#define _WDTEN_OFF_2H           0xFC    // WDT disabled in hardware; SWDTEN bit disabled.
#define _WDTEN_NOSLP_2H         0xFD    // WDT enabled only while device is active and disabled in Sleep mode; SWDTEN bit disabled.
#define _WDTEN_ON_2H            0xFE    // WDT controlled by SWDTEN bit setting.
#define _WDTEN_SWDTDIS_2H       0xFF    // WDT enabled in hardware; SWDTEN bit disabled.
#define _WDTPS_1_2H             0x83    // 1:1.
#define _WDTPS_2_2H             0x87    // 1:2.
#define _WDTPS_4_2H             0x8B    // 1:4.
#define _WDTPS_8_2H             0x8F    // 1:8.
#define _WDTPS_16_2H            0x93    // 1:16.
#define _WDTPS_32_2H            0x97    // 1:32.
#define _WDTPS_64_2H            0x9B    // 1:64.
#define _WDTPS_128_2H           0x9F    // 1:128.
#define _WDTPS_256_2H           0xA3    // 1:256.
#define _WDTPS_512_2H           0xA7    // 1:512.
#define _WDTPS_1024_2H          0xAB    // 1:1024.
#define _WDTPS_2048_2H          0xAF    // 1:2048.
#define _WDTPS_4096_2H          0xB3    // 1:4096.
#define _WDTPS_8192_2H          0xB7    // 1:8192.
#define _WDTPS_16384_2H         0xBB    // 1:16384.
#define _WDTPS_32768_2H         0xBF    // 1:32768.
#define _WDTPS_65536_2H         0xC3    // 1:65536.
#define _WDTPS_131072_2H        0xC7    // 1:131072.
#define _WDTPS_262144_2H        0xCB    // 1:262144.
#define _WDTPS_524288_2H        0xCF    // 1:524288.
#define _WDTPS_1048576_2H       0xFF    // 1:1048576.

//----------------------------- CONFIG3L Options -------------------------------

#define _RTCOSC_INTOSCREF_3L    0xFE    // RTCC uses INTRC.
#define _RTCOSC_SOSCREF_3L      0xFF    // RTCC uses SOSC.

//----------------------------- CONFIG3H Options -------------------------------

#define _CCP2MX_PORTBE_3H       0xFE    // RE7-Microcontroller Mode/RB3-All other modes.
#define _CCP2MX_PORTC_3H        0xFF    // RC1.
#define _ECCPMX_PORTH_3H        0xFD    // Enhanced CCP1/3 [P1B/P1C/P3B/P3C] muxed with RH7/RH6/RH5/RH4.
#define _ECCPMX_PORTE_3H        0xFF    // Enhanced CCP1/3 [P1B/P1C/P3B/P3C] muxed with RE6/RE5/RE4/RE3.
#define _MSSPMSK_MSK5_3H        0xF7    // 5 bit address masking mode.
#define _MSSPMSK_MSK7_3H        0xFF    // 7 Bit address masking mode.
#define _MCLRE_OFF_3H           0x7F    // MCLR Disabled, RG5 Enabled.
#define _MCLRE_ON_3H            0xFF    // MCLR Enabled, RG5 Disabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVREN_OFF_4L          0xFE    // Disabled.
#define _STVREN_ON_4L           0xFF    // Enabled.
#define _BBSIZ_BB1K_4L          0xEF    // 1K word Boot Block size.
#define _BBSIZ_BB2K_4L          0xFF    // 2K word Boot Block size.
#define _DEBUG_ON_4L            0x7F    // Enabled.
#define _DEBUG_OFF_4L           0xFF    // Disabled.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Enabled.
#define _CP0_OFF_5L             0xFF    // Disabled.
#define _CP1_ON_5L              0xFD    // Enabled.
#define _CP1_OFF_5L             0xFF    // Disabled.
#define _CP2_ON_5L              0xFB    // Enabled.
#define _CP2_OFF_5L             0xFF    // Disabled.
#define _CP3_ON_5L              0xF7    // Enabled.
#define _CP3_OFF_5L             0xFF    // Disabled.
#define _CP4_ON_5L              0xEF    // Enabled.
#define _CP4_OFF_5L             0xFF    // Disabled.
#define _CP5_ON_5L              0xDF    // Enabled.
#define _CP5_OFF_5L             0xFF    // Disabled.
#define _CP6_ON_5L              0xBF    // Enabled.
#define _CP6_OFF_5L             0xFF    // Disabled.
#define _CP7_ON_5L              0x7F    // Enabled.
#define _CP7_OFF_5L             0xFF    // Disabled.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Enabled.
#define _CPB_OFF_5H             0xFF    // Disabled.
#define _CPD_ON_5H              0x7F    // Enabled.
#define _CPD_OFF_5H             0xFF    // Disabled.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Enabled.
#define _WRT0_OFF_6L            0xFF    // Disabled.
#define _WRT1_ON_6L             0xFD    // Enabled.
#define _WRT1_OFF_6L            0xFF    // Disabled.
#define _WRT2_ON_6L             0xFB    // Enabled.
#define _WRT2_OFF_6L            0xFF    // Disabled.
#define _WRT3_ON_6L             0xF7    // Enabled.
#define _WRT3_OFF_6L            0xFF    // Disabled.
#define _WRT4_ON_6L             0xEF    // Enabled.
#define _WRT4_OFF_6L            0xFF    // Disabled.
#define _WRT5_ON_6L             0xDF    // Enabled.
#define _WRT5_OFF_6L            0xFF    // Disabled.
#define _WRT6_ON_6L             0xBF    // Enabled.
#define _WRT6_OFF_6L            0xFF    // Disabled.
#define _WRT7_ON_6L             0x7F    // Enabled.
#define _WRT7_OFF_6L            0xFF    // Disabled.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Enabled.
#define _WRTC_OFF_6H            0xFF    // Disabled.
#define _WRTB_ON_6H             0xBF    // Enabled.
#define _WRTB_OFF_6H            0xFF    // Disabled.
#define _WRTD_ON_6H             0x7F    // Enabled.
#define _WRTD_OFF_6H            0xFF    // Disabled.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBRT0_ON_7L            0xFE    // Enabled.
#define _EBRT0_OFF_7L           0xFF    // Disabled.
#define _EBRT1_ON_7L            0xFD    // Enabled.
#define _EBRT1_OFF_7L           0xFF    // Disabled.
#define _EBRT2_ON_7L            0xFB    // Enabled.
#define _EBRT2_OFF_7L           0xFF    // Disabled.
#define _EBRT3_ON_7L            0xF7    // Enabled.
#define _EBRT3_OFF_7L           0xFF    // Disabled.
#define _EBRT4_ON_7L            0xEF    // Enabled.
#define _EBRT4_OFF_7L           0xFF    // Disabled.
#define _EBRT5_ON_7L            0xDF    // Enabled.
#define _EBRT5_OFF_7L           0xFF    // Disabled.
#define _EBRT6_ON_7L            0xBF    // Enabled.
#define _EBRT6_OFF_7L           0xFF    // Disabled.
#define _EBRT7_ON_7L            0x7F    // Enabled.
#define _EBRT7_OFF_7L           0xFF    // Disabled.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBRTB_ON_7H            0xBF    // Enabled.
#define _EBRTB_OFF_7H           0xFF    // Disabled.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18F87K90_H__
